from django.shortcuts import render
from django.http import HttpResponse, HttpResponseRedirect
from django.urls import reverse 
import csv, requests, datetime
from static import models
from static.models import Water_data, User_data

# static variables
AccountBool = False
x = True

# index html
def index(request):
    up = Update()
    up.check()

    return render(request, 'index.html', locals())

# select function
def select(request, citys, mode):
    rivers = []
    citySelected = ""
    riverSelected = ""
    constentMsg = ""

    if 'city' in request.GET and request.GET['city'] != "請選擇城市":
        city = request.GET['city']

        citySelected = city
        rivers = citys[city]

    if 'river' in request.GET and request.GET['river'] != "請選擇河川" and request.GET['city'] != "請選擇城市":
        river = request.GET['river']

        if river in citys[city]:
            constentMsg += f"river: {river}"
        riverSelected = river

    citys = list(citys.keys())
    if(mode == 0):
        return citySelected, citys, rivers
    elif(mode == 1):
        return citySelected, citys, rivers
    else:
        return citySelected, citys, rivers

#以下為修改過程式
def reservoir(request):
    up = Update()
    up.check()

    city_data = {'基隆巿': ['10204', '10203'], '新北市': ['10205', '10302', '10212', '10211', '10214', '10213', '10209', '10207'], '桃園市': ['10206', '10201'], '宜蘭縣': ['10802', '40101'], '新竹縣': ['10401', '10405', '10404', '10503'], '苗栗縣': ['20510', '10501', '10601', '20101', '20405'], '臺中市': ['20201', '20207', '20203', '20205', '20206', '20202'], '南投縣': ['20501', '20507', '20502', '20504', '20508', '20505', '20506', '20503'], '雲林縣': ['20509'], '嘉義縣': ['30306', '30301', '30502'], '嘉義巿': ['30302'], '臺南市': ['30303', '30401', '30402', '30403', '30501', '30503', '30504', '30603', '30602', '30601'], '高雄市': ['31002', '30802', '30804', '30805', '30803', '30801', '30901'], '屏東縣': ['31201', '31202'], '花蓮縣': ['40201', '40203', '10215', '40202'], '澎湖縣': ['50104', '31301', '50102', '50103', '50108', '50105', '50109', '50106'], '金門縣': ['50204', '50206', '50205', '50207', '50202', '50203', '50201', '50213', '50214', '50212', '50210', '50208', '50209']}
    waterDatas = Water_data.objects.all()

    citySelected, citys, rivers = select(request, city_data, 0)

    datas = []
    if(citySelected !=""):
        for x in city_data[citySelected]:
            try:
                datas.append(waterDatas.get( Reservoir_id = x),)
                # add = [waterDatas.get(Reservoir_id = x), ]
                # add.append(dic(add[0]))
                # datas.append(add)

            except:
                continue
    
    return render(request, 'reservoir.html', locals())


def user(request):
    up = Update()
    up.check()
    
    city_data = {'基隆巿': {'安樂區': ['10204'], '暖暖區': ['10203']}, '新北市': {'新店區': ['10205', '10302', '10212', '10211'], '烏來區': ['10214', '10213', '10209'], '三峽區': ['10207']}, '桃園市': {'復興區': ['10206'], '龍潭區': ['10201']}, '宜蘭縣': {'三星鄉': ['10802'], '南澳鄉': ['40101']}, '新竹縣': {'寶山鄉': ['10401', '10405'], '竹東鎮': ['10404'], '峨眉鄉': ['10503']}, '苗栗縣': {'造橋鄉': ['20510'], '頭份市': ['10501'], '頭屋鄉': ['10601'], '三義鄉': ['20101'], '泰安鄉': ['20405']}, '臺中市': {'和平區': ['20201', '20207', '20203', '20205', '20206'], '石岡區': ['20202']}, '南投縣': {'仁愛鄉': ['20501', '20507'], '魚池鄉': ['20502', '20504'], '水里鄉': ['20508', '20505', '20506'], '集集鎮': ['20503']}, '雲林縣': {'斗六市': ['20509']}, '嘉義縣': {'民雄鄉': ['30306'], '番路鄉': ['30301'], '大埔鄉': ['30502']}, '臺南市': {'白河區': ['30303', '30401'], '柳營區': ['30402', '30403'], '六甲區': ['30501'], '南化區': ['30503', '30504'], '山上區': ['30603'], '新化區': ['30602', '30601']}, '高雄市': {'甲仙區': ['31002'], '燕巢區': ['30802'], '仁武區': ['30804'], '美濃區': ['30805'], '小港區': ['30803'], '鳥松區': ['30801'], '大樹區': ['30901']}, '屏東縣': {'牡丹鄉': ['31201'], '恆春鎮': ['31202']}, '花蓮縣': {'秀林鄉': ['40201', '40203', '10215', '40202']}, '臺東縣': {'綠島鄉': ['40701']}, '澎湖縣': {'白沙鄉': ['50104'], '湖西鄉': ['31301'], '馬公巿': ['50102', '50103'], '西嶼鄉': ['50108'], '望安鄉': ['50105', '50109'], '七美鄉': ['50106']}, '金門縣': {'金沙鎮': ['50204', '50206', '50205', '50207', '50202'], '金湖鎮': ['50203', '50201', '50213', '50214', '50212'], '烈嶼鄉': ['50210', '50208', '50209']}, '連江縣': {'東引鄉': ['50309'], '北竿鄉': ['50308'], '南竿鄉': ['50302', '50305', '50307', '50306', '50301', '50310']}}
    waste_data = {'基隆巿': {'安樂區': 105, '暖暖區': 1500}, '新北市': {'新店區': 100, '烏來區': 800, '三峽區': 650}, '桃園市': {'復興區': 310, '龍潭區': 741}, '宜蘭縣': {'三星鄉': 802, '南澳鄉': 101}, '新竹縣': {'寶山鄉': 405, '竹東鎮': 404, '峨眉鄉': 503}, '苗栗縣': {'造橋鄉': 510, '頭份市': 501, '頭屋鄉': 601, '三義鄉': 101, '泰安鄉': 405}, '臺中市': {'和平區': 201, '石岡區': 202}, '南投縣': {'仁愛鄉': 501, '魚池鄉': 502, '水里鄉': 508, '集集鎮': 503}, '雲林縣': {'斗六市': 205}, '嘉義縣': {'民雄鄉': 303, '番路鄉': 301, '大埔鄉': 305}, '臺南市': {'白河區': 303, '柳營區': 304, '六甲區': 501, '南化區': 503, '山上區': 603, '新化區': 602}, '高雄市': {'甲仙區': 310, '燕巢區': 802, '仁武區': 804, '美濃區': 805, '小港區': 308, '鳥松區': 801, '大樹區': 901}, '屏東縣': {'牡丹鄉': 312, '恆春鎮': 202}, '花蓮縣': {'秀林鄉': 202}, '臺東縣': {'綠島鄉': 701}, '澎湖縣': {'白沙鄉': 104, '湖西鄉': 301, '馬公巿': 102, '西嶼鄉': 501, '望安鄉': 105, '七美鄉': 106}, '金門縣': {'金沙鎮': 502, '金湖鎮': 203, '烈嶼鄉': 210}, '連江縣': {'東引鄉': 309, '北竿鄉': 308, '南竿鄉': 302}}

    accountBool = AccountBool
    signUp = x
    print(accountBool)
    user_Data = User_data.objects.all()
    water_Data = Water_data.objects.all()

    if 'input_account' in request.GET and 'input_password' in request.GET:
        try:
            obj = user_Data.get(user_name = request.GET['input_account'])
            if obj.password == request.GET['input_password']:
                accountBool = True
        except:
            return render(request, 'user.html', locals())
    else:
        return render(request, 'user.html', locals())
    waste = waste_data[obj.city][obj.region]
    allWater = sum([ water_Data.get(Reservoir_id = i).WaterLevel for i in city_data[obj.city][obj.region]]) * 100
    if allWater // waste <= 5:
        alarm = "缺水警告"
    elif allWater // waste <= 10:
        alarm = "即將缺水"
    else:
        alarm = "無"
    name = obj.name

    
    return render(request, 'user.html', locals())

def setUp(request):


    city_data = {'基隆巿': {'安樂區': ['10204'], '暖暖區': ['10203']}, '新北市': {'新店區': ['10205', '10302', '10212', '10211'], '烏來區': ['10214', '10213', '10209'], '三峽區': ['10207']}, '桃園市': {'復興區': ['10206'], '龍潭區': ['10201']}, '宜蘭縣': {'三星鄉': ['10802'], '南澳鄉': ['40101']}, '新竹縣': {'寶山鄉': ['10401', '10405'], '竹東鎮': ['10404'], '峨眉鄉': ['10503']}, '苗栗縣': {'造橋鄉': ['20510'], '頭份市': ['10501'], '頭屋鄉': ['10601'], '三義鄉': ['20101'], '泰安鄉': ['20405']}, '臺中市': {'和平區': ['20201', '20207', '20203', '20205', '20206'], '石岡區': ['20202']}, '南投縣': {'仁愛鄉': ['20501', '20507'], '魚池鄉': ['20502', '20504'], '水里鄉': ['20508', '20505', '20506'], '集集鎮': ['20503']}, '雲林縣': {'斗六市': ['20509']}, '嘉義縣': {'民雄鄉': ['30306'], '番路鄉': ['30301'], '大埔鄉': ['30502']}, '臺南市': {'白河區': ['30303', '30401'], '柳營區': ['30402', '30403'], '六甲區': ['30501'], '南化區': ['30503', '30504'], '山上區': ['30603'], '新化區': ['30602', '30601']}, '高雄市': {'甲仙區': ['31002'], '燕巢區': ['30802'], '仁武區': ['30804'], '美濃區': ['30805'], '小港區': ['30803'], '鳥松區': ['30801'], '大樹區': ['30901']}, '屏東縣': {'牡丹鄉': ['31201'], '恆春鎮': ['31202']}, '花蓮縣': {'秀林鄉': ['40201', '40203', '10215', '40202']}, '臺東縣': {'綠島鄉': ['40701']}, '澎湖縣': {'白沙鄉': ['50104'], '湖西鄉': ['31301'], '馬公巿': ['50102', '50103'], '西嶼鄉': ['50108'], '望安鄉': ['50105', '50109'], '七美鄉': ['50106']}, '金門縣': {'金沙鎮': ['50204', '50206', '50205', '50207', '50202'], '金湖鎮': ['50203', '50201', '50213', '50214', '50212'], '烈嶼鄉': ['50210', '50208', '50209']}, '連江縣': {'東引鄉': ['50309'], '北竿鄉': ['50308'], '南竿鄉': ['50302', '50305', '50307', '50306', '50301', '50310']}}
    citySelected, citys, rivers = select(request, city_data, 0)
    name =""
    account =""
    password = ""

    if 'password' in request.GET:
        password = request.GET['password']
    if 'account' in request.GET:
        account = request.GET['account']
    if 'name' in request.GET:
        name = request.GET['name']
    

    if 'river' in request.GET and 'city' in request.GET and 'password' in request.GET and 'name' in request.GET and 'account' in request.GET and request.GET['password'] != "" and request.GET['account'] != "" and request.GET['river'] != "" and request.GET['river'] != "請選擇地區" and request.GET['city'] != "請選擇城市":
        name = request.GET['name']
        user_name = request.GET['account']
        password = request.GET['password']
        city = request.GET['city']
        region = request.GET['river']
        new_account = models.User_data(
            name = name,
            user_name = user_name,
            password = password,
            city = city,
            region = region
        )
        new_account.save()
        return HttpResponseRedirect(reverse('user'))
    else:
        return render(request, 'setUp.html', locals())

def femilyUsed(request):
    up = Update()
    up.check()
    city_data = {'基隆巿': {'安樂區': 105, '暖暖區': 1500}, '新北市': {'新店區': 100, '烏來區': 800, '三峽區': 650}, '桃園市': {'復興區': 310, '龍潭區': 741}, '宜蘭縣': {'三星鄉': 802, '南澳鄉': 101}, '新竹縣': {'寶山鄉': 405, '竹東鎮': 404, '峨眉鄉': 503}, '苗栗縣': {'造橋鄉': 510, '頭份市': 501, '頭屋鄉': 601, '三義鄉': 101, '泰安鄉': 405}, '臺中市': {'和平區': 201, '石岡區': 202}, '南投縣': {'仁愛鄉': 501, '魚池鄉': 502, '水里鄉': 508, '集集鎮': 503}, '雲林縣': {'斗六市': 205}, '嘉義縣': {'民雄鄉': 303, '番路鄉': 301, '大埔鄉': 305}, '臺南市': {'白河區': 303, '柳營區': 304, '六甲區': 501, '南化區': 503, '山上區': 603, '新化區': 602}, '高雄市': {'甲仙區': 310, '燕巢區': 802, '仁武區': 804, '美濃區': 805, '小港區': 308, '鳥松區': 801, '大樹區': 901}, '屏東縣': {'牡丹鄉': 312, '恆春鎮': 202}, '花蓮縣': {'秀林鄉': 202}, '臺東縣': {'綠島鄉': 701}, '澎湖縣': {'白沙鄉': 104, '湖西鄉': 301, '馬公巿': 102, '西嶼鄉': 501, '望安鄉': 105, '七美鄉': 106}, '金門縣': {'金沙鎮': 502, '金湖鎮': 203, '烈嶼鄉': 210}, '連江縣': {'東引鄉': 309, '北竿鄉': 308, '南竿鄉': 302}}
    citySelected, citys, rivers = select(request, city_data, 1)
    datas = []

    if(citySelected !=""):
        datas = city_data[citySelected]
        print(datas)
    return render(request, 'femilyUsed.html', locals())

# update data to database 
class Update:
    def check(self):
        fr = open("static/update_time.txt", 'r')
        update_time = fr.readline().split('-')
        update_time = datetime.date(int(update_time[0]), int(update_time[1]), int(update_time[2]))
        if abs(datetime.date.today() - update_time).days >= 1:
            self.update()
        fr.close()

    def update(self):
        url = "https://data.wra.gov.tw/Service/OpenData.aspx?format=csv&id=1602CA19-B224-4CC3-AA31-11B1B124530F"
        r = requests.get(url)
        all_data = [d.split(',') for d in r.text.split('\n')]
        data = dict()
        for d in all_data[1:-1]:
            if d[10] not in data:
                if d[3] == "\"\"" or d[15] == "\"\"" or d[3] == '\"0\"' or d[15] == '\"0\"':
                    continue
                data[d[10]] = [d[3], d[15]]
                print(data[d[10]])
        dic = {'10204': '新山水庫', '10203': '西勢水庫', '10205': '翡翠水庫', '10302': '粗坑壩', '10212': '直潭壩', '10211': '青潭堰', '10214': '阿玉壩', '10213': '羅好壩', '10209': '桂山壩', '10206': '榮華壩', '10201': '石門水庫', '10207': '鳶山堰', '10802': '羅東攔河堰', '10401': '寶山水庫', '10405': '寶山第二水庫', '10404': '隆恩堰', '10503': '大埔水庫', '20510': '劍潭水庫', '10501': '永和山水庫', '10601': '明德水庫', '20101': '鯉魚潭水庫', '20405': '士林攔河堰', '20201': '德基水庫', '20207': '青山壩', '20203': '谷關水庫', '20205': '天輪壩', '20206': '馬鞍壩', '20202': '石岡壩', '20501': '霧社水庫', '20507': '武界壩', '20502': '日月潭水庫', '20504': '頭社水庫', '20508': '明湖下池水庫', '20505': '明潭下池水庫', '20506': '銃櫃壩', '20503': '集集攔河堰', '20509': '湖山水庫', '30306': '內埔子水庫', '30301': '仁義潭水庫', '30302': '蘭潭水庫', '30303': '鹿寮溪水庫', '30401': '白河水庫', '30402': '尖山埤水庫', '30403': '德元埤水庫', '30501': '烏山頭水庫', '30502': '曾文水庫', '30503': '南化水庫', '30504': '鏡面水庫', '31002': '甲仙攔河堰', '30603': '玉峰堰', '30602': '鹽水埤水庫', '30601': '虎頭埤水庫', '30802': '阿公店水庫', '30804': '觀音湖水庫', '30805': '美濃湖水庫', '30803': '鳳山水庫', '30801': '澄清湖水庫', '30901': '高屏溪攔河堰', '31201': '牡丹水庫', '31202': '龍鑾潭水庫', '40101': '南溪壩', '40201': '溪畔壩', '40203': '龍溪壩', '10215': '木瓜壩', '40202': '水簾壩', '40701': '酬勤水庫', '50104': '赤崁地下水庫', '31301': '成功水庫', '50102': '興仁水庫', '50103': '東衛水庫', '50108': '小池水庫', '50105': '西安水庫', '50109': '烏溝蓄水塘', '50106': '七美水庫', '50204': '山西水庫', '50206': '擎天水庫', '50205': '榮湖水庫', '50207': '金沙水庫', '50202': '田浦水庫', '50203': '陽明湖水庫', '50201': '太湖水庫', '50213': '瓊林水庫', '50214': '蘭湖水庫', '50212': '金湖水庫', '50210': '西湖水庫', '50208': '蓮湖水庫', '50209': '菱湖水庫', '50309': '東湧水庫', '50308': '坂里水庫', '50302': '秋桂山水庫', '50305': '儲水沃水庫', '50307': '津沙一號水庫', '50306': '津沙水庫', '50301': '勝利水庫', '50310': '后沃水庫'}

        #delete all data
        models.Water_data.objects.all().delete()
        for d in data:
            if d[1:-1] not in dic:
                continue
            new_item = models.Water_data(
                Reservoir_id = int(d[1:-1]),
                EffectiveWaterStorageCapacity = int(float(data[d][0][1:-1])*10000),
                WaterLevel = float(data[d][1][1:-2]),
                Reservoir_name = dic[str(d[1:-1])]
            )
            new_item.save()
        fw = open("static/update_time.txt", 'w')
        fw.write(str(datetime.date.today()))
        fw.close()
        
